In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'id': [1,2,3,4,5],
    'name':['Ed','Kate','Mark','Eva','Olga'],
    'age':[43,40,16,12,66],
    'income':[100,100,10,10,23]
})

#### This is an example of Lambda function use

In [3]:
df

   id  name  age  income
0   1    Ed   43     100
1   2  Kate   40     100
2   3  Mark   16      10
3   4   Eva   12      10
4   5  Olga   66      23

### Method 1

In [4]:
df['age'] = df['age'].apply(lambda x: x+1)

In [5]:
df

   id  name  age  income
0   1    Ed   44     100
1   2  Kate   41     100
2   3  Mark   17      10
3   4   Eva   13      10
4   5  Olga   67      23

### Method 2

In [6]:
df['age'] = df.apply(lambda x: x['age']+3, axis=1) #Note: x['age'], not df['age']!

In [7]:
df

   id  name  age  income
0   1    Ed   47     100
1   2  Kate   44     100
2   3  Mark   20      10
3   4   Eva   16      10
4   5  Olga   70      23

### Lambda with map

All the name's income gets increased by 20%. This means we have to increase the salary of each person by 20% in our Pandas dataframe. We can do this using the <b>map()</b> function. This <b>map()</b> function maps the series according to input correspondence. It is very helpful when we have to substitute a series with other values. In <b>map()</b> functions, the size of the input is equal to the size of the output.

In [10]:
df['income']=list(map(lambda x: int(x+x*0.2),df['income']))

In [11]:
df

   id  name  age  income
0   1    Ed   47     120
1   2  Kate   44     120
2   3  Mark   20      12
3   4   Eva   16      12
4   5  Olga   70      27

### Conditional Statements using Lambda Functions

Lambda functions also support conditional statements, such as if..else. This makes lambda functions very powerful.

Let’s say in the family dataframe we have to categorize people into ‘Adult’ or ‘Child’. For this, we can simply apply the lambda function to our dataframe:

In [12]:
df['category']=df['age'].apply(lambda x: 'Adult' if x>18 else 'Child')

In [13]:
df

   id  name  age  income category
0   1    Ed   47     120    Adult
1   2  Kate   44     120    Adult
2   3  Mark   20      12    Adult
3   4   Eva   16      12    Child
4   5  Olga   70      27    Adult